import logging
import os
import re
from enum import Enum

from dotenv import load_dotenv

load_dotenv()

logger = logging.getLogger(__name__)

TOKEN = os.getenv("TOKEN")
if not TOKEN:
    raise Exception("TOKEN not found")

MONGO_URI = os.getenv("MONGO_URI")
if not MONGO_URI:
    MONGO_URI = "mongodb://localhost:27017"
    logger.warning("MONGO_URI not found, using default value")
MONGO_DB_NAME = os.getenv("MONGO_DB_NAME", "TimohaBot")

ENVIRONMENT = os.getenv("ENVIRONMENT")
if not ENVIRONMENT:
    raise Exception("ENVIRONMENT not set")

IS_PRODUCTION = ENVIRONMENT.lower() == "production"
GUILD_ID = 1245655012550512670 if IS_PRODUCTION else 1460315965639229615

RANK_ROLES = {
    "Рядовой": 1246114675574313021,
    "Ефрейтор": 1246114674638983270,
    "Младший сержант": 1261982952275972187,
    "Сержант": 1246114673997123595,
    "Старший сержант": 1246114672352952403,
    "Старшина": 1246114604958879754,
    "Прапорщик": 1246114604329865327,
    "Старший прапорщик": 1251045305793773648,
    "Младший лейтенант": 1251045263062335590,
    "Лейтенант": 1246115365746901094,
    "Старший лейтенант": 1246114469340250214,
    "Капитан": 1246114469336322169,
    "Майор": 1246114042821607424,
    "Подполковник": 1246114038744875090,
    "Полковник": 1246113825791672431,
    "Генерал-майор": 1246113709093556337,
    "Генерал-лейтенант": 1262442013241118820,
    "Генерал-полковник": 1262442305290371153,
    "Генерал армии": 1246113708514476073,
}
if not IS_PRODUCTION:
    RANK_ROLES["Рядовой"] = 1460318445538246706
    RANK_ROLES["Младший сержант"] = 1460318656947818642
    RANK_ROLES["Старший сержант"] = 1460318688434721043

RANKS_SHORT = [
    "Р-й",
    "Еф-р",
    "Мл. С-т",
    "С-т",
    "Ст. С-т",
    "С-на.",
    "Пр-к",
    "Ст. Пр-к",
    "Мл. Л-т",
    "Л-т",
    "Ст. Л-т",
    "К-н",
    "М-р",
    "П/п-к",
    "П-к",
    "Ген.-м",
    "Ген.-л",
    "Ген.-п",
    "Ген. а.",
]

RANK_EMOJIS = [
    "<:ryadovoy:1461146769978167328>",  # Рядовой
    "<:efreytor:1461146762399055943>",  # Ефрейтор
    "<:ml_serzhant:1461146765603508387>",  # Младший сержант
    "<:serzhant:1461146772171788525>",  # Сержант
    "<:st_serzhant:1461147075851849762>",  # Старший сержант
    "<:starshina:1461146776617877637>",  # Старшина
    "<:praporshchik:1461147078511169762>",  # Прапорщик
    "<:st_praporshchik:1461146782527520789>",  # Старший прапорщик
    "<:ml_leytenant:1461146778895257610>",  # Младший лейтенант
    "<:leytenant:1461146785958592706>",  # Лейтенант
    "<:st_leytenant:1461146736398565548>",  # Старший лейтенант
    "<:kapitan:1461147080037761187>",  # Капитан
    "<:mayor:1461147081916940350>",  # Майор
    "<:podpolkovnik:1461146740316049613>",  # Подполковник
    "<:polkovnik:1461146749463822441>",  # Полковник
    "<:generalmayor:1461146745886085224>",  # Генерал-майор
    "<:generalleytenant:1461146744313348160>",  # Генерал-лейтенант
    "<:generalpolkovnik:1461146747572191334>",  # Генерал-полковник
    "<:general_armii:1461146750998810776>",  # Генерал армии
]

RANKS = list(RANK_ROLES.keys())
AVAILABLE_FOR_REINSTATEMENT = RANKS[4:12]  # "Старший сержант" -> "Капитан"

CHANNELS = (
    {
        "audit": 1246119365607424050,
        "reinstatement": 1317830537724952626,
        "role_getting": 1246118891864723576,
        "blacklist": 1246119574357807246,
        "storage_requests": 1386780423098732567,
        "storage_audit": 1246119396225843261,
        "dismissal": 1246119825487564981,
        "static_log": 1246123219006787636,
    }
    if IS_PRODUCTION
    else {
        "audit": 1460316387216986378,
        "reinstatement": 1460316020068581597,
        "role_getting": 1460316054101168366,
        "blacklist": 1460316417827278902,
        "storage_requests": 1460316441634017456,
        "storage_audit": 1460316457291354112,
        "dismissal": 1460316577449906196,
        "static_log": 1460316549331288342,
    }
)

SUPPLY_ITEMS = {
    "Оружие": [
        "АК-74М",
        "Кольт М16",
        "Кольт 416 Канада",
        "ФН СКАР-Т",
        "Штейр АУГ-А3",
        "Таурус Бешеный бык",
        "Таурус Бешеный бык МК2",
        "CAP M249",
        "Обрез",
        "Тип 97",
        "Сайга-12К",
    ],
    "Броня": ["Средний бронежилет", "Тяжелый бронежилет"],
    "Медикаменты": [
        "Комплект мед. помощи",
        "Армейская аптечка",
        "Обезболивающее",
        "Дефибриллятор",
    ],
    "Прочее": ["Бодикамеры", "Патроны", "Материалы", "Прочее"],
}

SUPPLY_LIMITS = {
    "Оружие": 3,  # Лимит на категорию Оружие (суммарно)
    "Материалы": 2000,  # Материалы
    "Броня": 20,  # Бронежилеты
    "Медикаменты": 25,  # Общий лимит на медикаменты
    "Обезболивающее": 15,  # Конкретный предмет
    "Дефибриллятор": 15,  # Конкретный предмет
}

BLACKLIST_MENTIONS = (1245655012760092707, 1245655012760092705, 1246113710255374336)
SUPPLIES_AUDIT_MENTIONS = (1245655012760092707, 1245655012760092705)

if IS_PRODUCTION:

    class RoleId(Enum):
        REINFORCEMENT = 1318305723637301268
        ATTESTATION = 1246115278992048262
        CONTRACT = 1246115199124111544
        MILITARY = 1246114676136218714  # Военнослужащий ВС РФ
        MILITARY_ACADEMY = 1246114673460252692  # Военная академия
        SUPPLY_ACCESS = 1246115197781934161  # Доступ к поставке
        GOV_EMPLOYEE = 1251432181381861477  # Гос. сотрудник
else:

    class RoleId(Enum):
        REINFORCEMENT = 1460321975091335291
        ATTESTATION = 1461081251061432350
        CONTRACT = 1460319346646581477
        MILITARY = 1462831391438934128  # Военнослужащий ВС РФ
        MILITARY_ACADEMY = 1460321456456990959  # Военная академия
        SUPPLY_ACCESS = 1460318487279960164  # Доступ к поставке
        GOV_EMPLOYEE = 1461101073392472178  # Гос. сотрудник


PENALTY_THRESHOLD = 5


class RankIndex:
    """Индексы званий для проверок прав доступа"""

    PRIVATE = 0  # Рядовой
    CORPORAL = 1  # Ефрейтор
    JUNIOR_SERGEANT = 2  # Младший сержант
    SERGEANT = 3  # Сержант
    SENIOR_SERGEANT = 4  # Старший сержант
    SERGEANT_MAJOR = 5  # Старшина
    WARRANT_OFFICER = 6  # Прапорщик
    SENIOR_WARRANT = 7  # Старший прапорщик
    JUNIOR_LIEUTENANT = 8  # Младший лейтенант
    LIEUTENANT = 9  # Лейтенант
    SENIOR_LIEUTENANT = 10  # Старший лейтенант
    CAPTAIN = 11  # Капитан
    MAJOR = 12  # Майор
    LIEUTENANT_COLONEL = 13  # Подполковник
    COLONEL = 14  # Полковник
    MAJOR_GENERAL = 15  # Генерал-майор
    LIEUTENANT_GENERAL = 16  # Генерал-лейтенант
    COLONEL_GENERAL = 17  # Генерал-полковник
    ARMY_GENERAL = 18  # Генерал армии


SUPPLY_INFO_LINK = "https://discord.com/channels/1245655012550512670/1251166871064019015/1460964263140003860"

CAPTAIN_RANK_INDEX = RankIndex.CAPTAIN
nickname_regex = re.compile('^([А-я][а-я]+) ([А-я][а-я]+)$')
